### How to select subsets in Pandas - part 1: .loc  .iloc
wg https://medium.com/dunder-data/selecting-subsets-of-data-in-pandas-6fcd0170be9c

In [0]:
import pandas as pd
import numpy as np

*Przy czytaniu plików csv musi być do path wskazany raw - dla pliku, inaczej czyta plik z html, pierwsza kolumna została wskazana jako index*

In [0]:
path = 'https://raw.githubusercontent.com/tdpetrou/Learn-Pandas/master/data/sample_data.csv'
df = pd.read_csv(path, sep = ',', header = [0], index_col = 0)

In [24]:
print(df)

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

### DataFrame components

In [0]:
index = df.index
columns = df.columns
values = df.values

In [26]:
index

Index(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'], dtype='object')

In [27]:
columns

Index(['state', 'color', 'food', 'age', 'height', 'score'], dtype='object')

In [28]:
values

array([['NY', 'blue', 'Steak', 30, 165, 4.6],
       ['TX', 'green', 'Lamb', 2, 70, 8.3],
       ['FL', 'red', 'Mango', 12, 120, 9.0],
       ['AL', 'white', 'Apple', 4, 80, 3.3],
       ['AK', 'gray', 'Cheese', 32, 180, 1.8],
       ['TX', 'black', 'Melon', 33, 172, 9.5],
       ['TX', 'red', 'Beans', 69, 150, 2.2]], dtype=object)

In [29]:
type(index)

pandas.core.indexes.base.Index

In [30]:
type(columns)

pandas.core.indexes.base.Index

In [31]:
type(values)

numpy.ndarray

*Zarówno index i columns mają ten sam typ: index - wartości "nagłówków" dla kolumn i wierszy.
Wartości samej tabeli są elementem macierzy -np ndarray - kontenera na dane w NumPy*

### Wybieranie kolumn

In [32]:
df['food']

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

*Przy wybieraniu kolumn otrzymujemy kontener z danymi - serię. Jest to jednowymiarowa sekwencja danych z nagłówkami.  W skład serii wchodzi: index (w tym przypadku imiona) oraz wartości(dane - w tym przypadku: food). Nie ma kolumn w serii.*

In [37]:
df[['color','food','score']] #przy wybieraniu kilku kolumn - podwójny []-lista kolumn

           color    food  score
Jane        blue   Steak    4.6
Niko       green    Lamb    8.3
Aaron        red   Mango    9.0
Penelope   white   Apple    3.3
Dean        gray  Cheese    1.8
Christina  black   Melon    9.5
Cornelia     red   Beans    2.2

*W tym przypadku otrzymujemy DataFrame, a nie serię*

In [38]:
df[['food']] #aby otrzymać DataFrame dla 1 kolumny, trzeba ją podać jako listę - podwójny[], wygląda podobnie, ale inny kontner

             food
Jane        Steak
Niko         Lamb
Aaron       Mango
Penelope    Apple
Dean       Cheese
Christina   Melon
Cornelia    Beans

In [39]:
df[['height', 'color']] #kolejność nie jest ważna

           height  color
Jane          165   blue
Niko           70  green
Aaron         120    red
Penelope       80  white
Dean          180   gray
Christina     172  black
Cornelia      150    red

*Najczęstsze błędy*

1.   Literówka w nazwie kolumny: 'colour' zamiast 'color' - KeyError
2.   Jak sie zapomni listy do wybierania kilku kolumn = df['color', 'age'] zamiast df[['color', 'age']]-też KeyError

### .loc 
Indeksowanie za pomocą .loc- można wybierać wiersze lub kolumny, ale jedynie przez nazwę danej kolumny czy wiersza

In [40]:
df.loc['Niko'] #zwraca serię, gdzie kolumny stały się indexem, a nazwa Serii to nazwa wybieranej kolumny

state        TX
color     green
food       Lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

In [41]:
df.loc[['Niko', 'Penelope']] #zwraca DF - dla kilku wierszy, które trzeba podać jako listę: [[]]

         state  color   food  age  height  score
Niko        TX  green   Lamb    2      70    8.3
Penelope    AL  white  Apple    4      80    3.3

In [43]:
df.loc['Niko':'Dean'] #wycinek z użyciem :, ale bez listy. Uwaga: uwzględnia ostatnią wartość: Dean, inaczej niz np w listach Pythona

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

*Wycinek:*
*df.loc['od': 'do': step]*

In [44]:
df.loc[:'Aaron'] #wycinek od początku do Aarona włącznie

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

In [45]:
df.loc['Niko':'Christina': 2] #od NIko do Christina,dla  step = 2

          state  color   food  age  height  score
Niko         TX  green   Lamb    2      70    8.3
Penelope     AL  white  Apple    4      80    3.3
Christina    TX  black  Melon   33     172    9.5

In [46]:
df.loc['Dean':] #od Deana do końca

          state  color    food  age  height  score
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

*Przy pomocy  .loc można wybierać jednocześnie wiersze i kolumny: df.loc[row_selection, column_selection]*

In [47]:
df.loc[['Dean', 'Cornelia'], ['age', 'state', 'score']] #wybranie jednocześnie kilku kolumn i wierszy

          age state  score
Dean       32    AK    1.8
Cornelia   69    TX    2.2

In [49]:
df.loc[['Dean', 'Aaron'], 'food'] #wybieranie przez nazwy nagłówków - dla kilku - lista

Dean     Cheese
Aaron     Mango
Name: food, dtype: object

In [51]:
df.loc[['Dean', 'Aaron'], ['food']] # jak lista przy food to zrobi DF

         food
Dean   Cheese
Aaron   Mango

In [50]:
df.loc['Jane': 'Penelope', ['state', 'color']] #wybieranie przez slice : - wtedy bez []

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

In [52]:
df.loc['Jane', 'age'] #zwróci konkretną wartość

30

In [53]:
df.loc[:'Dean', 'height':] #podwójny wycinek

          height  score
Jane         165    4.6
Niko          70    8.3
Aaron        120    9.0
Penelope      80    3.3
Dean         180    1.8

In [54]:
df.loc[:, ['food', 'color']] #wszystkie wiersze i dwie kolumny

             food  color
Jane        Steak   blue
Niko         Lamb  green
Aaron       Mango    red
Penelope    Apple  white
Dean       Cheese   gray
Christina   Melon  black
Cornelia    Beans    red

In [55]:
df.loc[['Penelope', 'Aaron'], :] #dwa wiersze wszystkie kolumny

         state  color   food  age  height  score
Penelope    AL  white  Apple    4      80    3.3
Aaron       FL    red  Mango   12     120    9.0

*Można wcześniej przypisać kilka wierszy/kolumn do nowych zmiennych, by łatwiej operować*

In [56]:
rows = ['Jane', 'Niko', 'Aaron', 'Penelope']
columns = ['age', 'score', 'state', 'height']
df.loc[rows, columns]

          age  score state  height
Jane       30    4.6    NY     165
Niko        2    8.3    TX      70
Aaron      12    9.0    FL     120
Penelope    4    3.3    AL      80

### Podsumowanie .loc###


1.   Indeksowanie jedynie za pomocą nagłówków
2.   Można równocześnie wybrać wiersze i kolumny
3. Można wybrać pojedynczy nagłówek, listę nagłówków lub wycinek
4. Przecinek oddziela wybierane wiersze od kolumn

### .iloc
*Podobnie jak .loc tyle że indeksowanie za pomocą integer - np. [0]*

In [57]:
df.iloc[3] #wiersz nr 3 jako seria, gdzie nagłówek wiersza jest name serii

state        AL
color     white
food      Apple
age           4
height       80
score       3.3
Name: Penelope, dtype: object

In [59]:
df.iloc[[3]] #ponieważ lista to jako DF

         state  color   food  age  height  score
Penelope    AL  white  Apple    4      80    3.3

In [58]:
df.iloc[[5, 2, 4]] #kilka wierszy - wtedy jako DF,bo lista [[]]

          state  color    food  age  height  score
Christina    TX  black   Melon   33     172    9.5
Aaron        FL    red   Mango   12     120    9.0
Dean         AK   gray  Cheese   32     180    1.8

In [60]:
df.iloc[3:5] #wycinek, ale tutaj już bez ostatniego wiersza - nr 5, inaczej niz przy  .loc

         state  color    food  age  height  score
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [61]:
df.iloc[3:] #od wiersza 3 do końca

          state  color    food  age  height  score
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [62]:
df.iloc[:3] #od początku do wiersza 3, bez niego

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

In [63]:
df.iloc[3::2] #od 3go do końca co dwa wiersze step

          state  color   food  age  height  score
Penelope     AL  white  Apple    4      80    3.3
Christina    TX  black  Melon   33     172    9.5

In [64]:
df.iloc[[2,4], [0,3]] #dwa wiersze, dwie kolumny

      state  age
Aaron    FL   12
Dean     AK   32

In [67]:
df.iloc[3:6, [1,4]] #dla wierszy wycinek - wtedy bez listy, dla kolumn lista

           color  height
Penelope   white      80
Dean        gray     180
Christina  black     172

In [68]:
df.iloc[3:6, 1:4]#dla wierszy i kolumn wycinek

           color    food  age
Penelope   white   Apple    4
Dean        gray  Cheese   32
Christina  black   Melon   33

In [69]:
df.iloc[2,5] #wybrana konkretna wartość

9.0

In [70]:
df.iloc[:, 5] #wszystkie wiersze, jedna kolumna

Jane         4.6
Niko         8.3
Aaron        9.0
Penelope     3.3
Dean         1.8
Christina    9.5
Cornelia     2.2
Name: score, dtype: float64

In [71]:
df.iloc[5, :] #jeden wiersz, wszystkie kolumny

state        TX
color     black
food      Melon
age          33
height      172
score       9.5
Name: Christina, dtype: object

### Wybieranie fragmentów dla utworzonej serii

In [72]:
food = df['food']
food

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

In [73]:
food.loc['Aaron'] #podobnie jak przy tabeli, wybieramy po nagłówkach

'Mango'

In [74]:
food.loc[['Niko', 'Penelope', 'Cornelia']] #zwraca serię!!

Niko         Lamb
Penelope    Apple
Cornelia    Beans
Name: food, dtype: object

In [75]:
food.loc['Jane': 'Penelope'] #wycinek, uwzględnia ostatni wiersz, też seria!

Jane        Steak
Niko         Lamb
Aaron       Mango
Penelope    Apple
Name: food, dtype: object

In [76]:
food.loc['Dean':] #od Deana do końca

Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

In [77]:
food.loc[['Dean']] #nawet przy liście, będzie seria!!

Dean    Cheese
Name: food, dtype: object

In [78]:
food.iloc[0]#indeksowanie .iloc za pomocą integers

'Steak'

In [79]:
food.iloc[[3,2,1]] #tutaj też seria

Penelope    Apple
Aaron       Mango
Niko         Lamb
Name: food, dtype: object

In [80]:
food.iloc[0:5]# przy indeksowaniu .iloc - bez uwzględnienia ostatniego, inaczej niż w .loc

Jane         Steak
Niko          Lamb
Aaron        Mango
Penelope     Apple
Dean        Cheese
Name: food, dtype: object

### Importowanie danych bez wskazywania pierwszej kolumny jako indeksu

In [81]:
df2 = pd.read_csv('https://raw.githubusercontent.com/tdpetrou/Learn-Pandas/master/data/sample_data2.csv')
df2

       Names state  color    food  age  height  score
0       Jane    NY   blue   Steak   30     165    4.6
1       Niko    TX  green    Lamb    2      70    8.3
2      Aaron    FL    red   Mango   12     120    9.0
3   Penelope    AL  white   Apple    4      80    3.3
4       Dean    AK   gray  Cheese   32     180    1.8
5  Christina    TX  black   Melon   33     172    9.5
6   Cornelia    TX    red   Beans   69     150    2.2

In [82]:
df2.index

RangeIndex(start=0, stop=7, step=1)

*Tutaj pandas tworzy index sam domyślnie przez range*

In [83]:
df2.loc[[2,5,4], ['food', 'color']] #wybieramy wiersze po nazwach - nadanych przez range, kolumny tez po nazwach

     food  color
2   Mango    red
5   Melon  black
4  Cheese   gray

In [85]:
df2.iloc[[2,5,4], [1,3,4]] #w iloc same numery wierszy i kolumn

  state    food  age
2    FL   Mango   12
5    TX   Melon   33
4    AK  Cheese   32

In [86]:
df2.iloc[:3] #przy iloc jest bez 3go wiersza

   Names state  color   food  age  height  score
0   Jane    NY   blue  Steak   30     165    4.6
1   Niko    TX  green   Lamb    2      70    8.3
2  Aaron    FL    red  Mango   12     120    9.0

In [87]:
df2.loc[:3] #przy loc jest z 3cim wierszem

      Names state  color   food  age  height  score
0      Jane    NY   blue  Steak   30     165    4.6
1      Niko    TX  green   Lamb    2      70    8.3
2     Aaron    FL    red  Mango   12     120    9.0
3  Penelope    AL  white  Apple    4      80    3.3

### Jak później nadać index

In [88]:
df2_idx = df2.set_index('Names')
df2_idx

          state  color    food  age  height  score
Names
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

*W takim przypadku kolumnie indeksującej jest nadawana nazwa. Na samym początku, gdy wskazywaliśmy indeks przy pobieraniu danych, kolumna indeksu nie miała nazwy*

### Dostęp do kolumn przy pomocy atrybutu DF

In [89]:
df.state

Jane         NY
Niko         TX
Aaron        FL
Penelope     AL
Dean         AK
Christina    TX
Cornelia     TX
Name: state, dtype: object

In [90]:
df.age

Jane         30
Niko          2
Aaron        12
Penelope      4
Dean         32
Christina    33
Cornelia     69
Name: age, dtype: int64

### Cwiczenia

In [0]:
path = 'https://raw.githubusercontent.com/tdpetrou/Learn-Pandas/master/data/food_inspections.csv'
df_food = pd.read_csv(path)

In [102]:
df_food.head(5)

                    DBA Name  ...                                         Violations
0               DANY'S TACOS  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
1      BILLY FOOD MARKET INC  ...                                                NaN
2  TAQUERIA HACIENDA TAPATIA  ...  2. FACILITIES TO MAINTAIN PROPER TEMPERATURE -...
3     WILD GOOSE BAR & GRILL  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
4         PUBLICAN TAVERN K1  ...  18. NO EVIDENCE OF RODENT OR INSECT OUTER OPEN...

[5 rows x 9 columns]

In [106]:
df_food = df_food.set_index('DBA Name') #trzeba nadpisać df z nowym indeksem
df_food.head()

                          Facility Type  ...                                         Violations
DBA Name                                 ...
DANY'S TACOS                 Restaurant  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
BILLY FOOD MARKET INC               NaN  ...                                                NaN
TAQUERIA HACIENDA TAPATIA    Restaurant  ...  2. FACILITIES TO MAINTAIN PROPER TEMPERATURE -...
WILD GOOSE BAR & GRILL       Restaurant  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
PUBLICAN TAVERN K1           Restaurant  ...  18. NO EVIDENCE OF RODENT OR INSECT OUTER OPEN...

[5 rows x 8 columns]

In [109]:
df_food['Risk'].head()

DBA Name
DANY'S TACOS                 Risk 1 (High)
BILLY FOOD MARKET INC         Risk 3 (Low)
TAQUERIA HACIENDA TAPATIA    Risk 1 (High)
WILD GOOSE BAR & GRILL       Risk 1 (High)
PUBLICAN TAVERN K1           Risk 1 (High)
Name: Risk, dtype: object

In [110]:
df_food.Risk.head()

DBA Name
DANY'S TACOS                 Risk 1 (High)
BILLY FOOD MARKET INC         Risk 3 (Low)
TAQUERIA HACIENDA TAPATIA    Risk 1 (High)
WILD GOOSE BAR & GRILL       Risk 1 (High)
PUBLICAN TAVERN K1           Risk 1 (High)
Name: Risk, dtype: object

In [112]:
df_food[['Risk', 'Results']].head()

                                    Risk    Results
DBA Name
DANY'S TACOS               Risk 1 (High)       Fail
BILLY FOOD MARKET INC       Risk 3 (Low)  Not Ready
TAQUERIA HACIENDA TAPATIA  Risk 1 (High)       Pass
WILD GOOSE BAR & GRILL     Risk 1 (High)       Fail
PUBLICAN TAVERN K1         Risk 1 (High)       Fail

In [113]:
df_food[['Risk']].head()

                                    Risk
DBA Name
DANY'S TACOS               Risk 1 (High)
BILLY FOOD MARKET INC       Risk 3 (Low)
TAQUERIA HACIENDA TAPATIA  Risk 1 (High)
WILD GOOSE BAR & GRILL     Risk 1 (High)
PUBLICAN TAVERN K1         Risk 1 (High)

In [117]:
df_food.loc['WILD GOOSE BAR & GRILL'] #zwraca serię

Facility Type                                             Restaurant
Risk                                                   Risk 1 (High)
Address                                          4265 N LINCOLN AVE
Zip                                                            60618
Inspection Date                                           03/27/2017
Inspection Type                                              Canvass
Results                                                         Fail
Violations         16. FOOD PROTECTED DURING STORAGE, PREPARATION...
Name: WILD GOOSE BAR & GRILL, dtype: object

In [118]:
df_food.loc[['WILD GOOSE BAR & GRILL', 'TAQUERIA HACIENDA TAPIATA'], ['Risk', 'Results']]

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

                                    Risk Results
DBA Name
WILD GOOSE BAR & GRILL     Risk 1 (High)    Fail
TAQUERIA HACIENDA TAPIATA            NaN     NaN

In [119]:
df_food.loc['SCRUB A DUB', 'Risk']

'Risk 2 (Medium)'

In [122]:
df_food.loc['THRESHOLD SCHOOL':'SCRUB A DUB': 3000, 'Inspection Type']

DBA Name
THRESHOLD SCHOOL                         Canvass
SAN JOSE FAST FOOD                       Canvass
CHUCHOS ON ADDISON INC                   Canvass
PIZZERIA AROMA             Canvass Re-Inspection
JEWEL FOOD STORE #3210                   Canvass
EGANS TAVERN                             Canvass
Los Amigos Grill                         Canvass
JOHNNY VAN'S SMOKEHOUSE                  License
WEN   CAFE INC                   Out of Business
Name: Inspection Type, dtype: object

In [124]:
df_food.iloc[500:510]

                                  Facility Type  ...                                         Violations
DBA Name                                         ...
THE MECCA RESTAURANT                 Restaurant  ...  8. SANITIZING RINSE FOR EQUIPMENT AND UTENSILS...
L & T CHINA FAST WOK INC.            Restaurant  ...  33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...
SCHNEIDER  SENIOR  APARTMENT       Golden Diner  ...  35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTR...
ECKHARDT CAFE                        Restaurant  ...  33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...
WING ZONE                            Restaurant  ...                                                NaN
ARBYS                                Restaurant  ...  34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOO...
LAS ISLAS MARIAS                     Restaurant  ...  30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABEL...
MARGARET'S                           Restaurant  ...  33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...
POPEYES FAMOUS FRIED CHICKEN         Restaurant  ...  3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATUR...
PJ PIZZA COMPANY 1 DBA PAPA JOHNS    Restaurant  ...                                                NaN

[10 rows x 8 columns]

In [125]:
df_food.iloc[[100, 1000, 1000], [5,3,1]]

                    Inspection Type      Zip           Risk
DBA Name
TAQUERIA LA CANTERA         License  60608.0  Risk 1 (High)
PARK TAVERN CHICAGO       Complaint  60612.0  Risk 1 (High)
PARK TAVERN CHICAGO       Complaint  60612.0  Risk 1 (High)

In [127]:
df_risk = df_food['Risk']
type(df_risk)

pandas.core.series.Series

In [129]:
df_risk.loc[['ARBYS', 'POPEYES FAMOUS FRIED CHICKEN']]

DBA Name
ARBYS                             Risk 1 (High)
POPEYES FAMOUS FRIED CHICKEN    Risk 2 (Medium)
Name: Risk, dtype: object